results/task#6/wrk_put.txt
wrk  -t4 -c200 -d30s -sput.lua -R2000 --latency http://localhost:8080
Running 30s test @ http://localhost:8080
  4 threads and 200 connections
  Thread calibration: mean lat.: 9.009ms, rate sampling interval: 43ms
  Thread calibration: mean lat.: 11.852ms, rate sampling interval: 42ms
  Thread calibration: mean lat.: 8.297ms, rate sampling interval: 41ms
  Thread calibration: mean lat.: 8.472ms, rate sampling interval: 42ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     7.55ms    7.15ms  82.82ms   84.49%
    Req/Sec   505.31    287.56     1.22k    77.45%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    4.64ms
 75.000%   11.72ms
 90.000%   17.04ms
 99.000%   28.90ms
 99.900%   59.39ms
 99.990%   78.78ms
 99.999%   82.88ms
100.000%   82.88ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.460     0.000000            1         1.00
       1.465     0.100000         3955         1.11
       1.913     0.200000         7894         1.25
       2.385     0.300000        11845         1.43
       3.099     0.400000        15784         1.67
       4.639     0.500000        19727         2.00
       5.951     0.550000        21701         2.22
       7.435     0.600000        23673         2.50
       8.775     0.650000        25644         2.86
      10.175     0.700000        27627         3.33
      11.719     0.750000        29593         4.00
      12.447     0.775000        30582         4.44
      13.207     0.800000        31564         5.00
      14.023     0.825000        32553         5.71
      14.895     0.850000        33536         6.67
      15.895     0.875000        34521         8.00
      16.463     0.887500        35022         8.89
      17.039     0.900000        35509        10.00
      17.647     0.912500        36006        11.43
      18.319     0.925000        36498        13.33
      19.087     0.937500        36995        16.00
      19.519     0.943750        37238        17.78
      20.031     0.950000        37484        20.00
      20.687     0.956250        37729        22.86
      21.407     0.962500        37978        26.67
      22.303     0.968750        38221        32.00
      22.767     0.971875        38344        35.56
      23.343     0.975000        38468        40.00
      24.063     0.978125        38589        45.71
      24.911     0.981250        38714        53.33
      26.143     0.984375        38836        64.00
      26.799     0.985938        38898        71.11
      27.439     0.987500        38960        80.00
      28.335     0.989062        39022        91.43
      29.535     0.990625        39084       106.67
      31.295     0.992188        39144       128.00
      32.655     0.992969        39175       142.22
      34.751     0.993750        39207       160.00
      36.671     0.994531        39237       182.86
      39.455     0.995313        39269       213.33
      42.207     0.996094        39298       256.00
      43.935     0.996484        39315       284.44
      45.119     0.996875        39329       320.00
      47.263     0.997266        39345       365.71
      49.567     0.997656        39361       426.67
      51.615     0.998047        39375       512.00
      53.663     0.998242        39383       568.89
      54.559     0.998437        39391       640.00
      56.991     0.998633        39399       731.43
      58.079     0.998828        39406       853.33
      60.063     0.999023        39414      1024.00
      61.151     0.999121        39418      1137.78
      62.111     0.999219        39422      1280.00
      62.847     0.999316        39426      1462.86
      64.351     0.999414        39429      1706.67
      66.879     0.999512        39433      2048.00
      68.223     0.999561        39435      2275.56
      69.055     0.999609        39437      2560.00
      69.823     0.999658        39439      2925.71
      72.959     0.999707        39441      3413.33
      73.663     0.999756        39443      4096.00
      75.199     0.999780        39444      4551.11
      75.583     0.999805        39445      5120.00
      76.927     0.999829        39446      5851.43
      78.079     0.999854        39447      6826.67
      78.783     0.999878        39448      8192.00
      78.783     0.999890        39448      9102.22
      78.847     0.999902        39449     10240.00
      78.847     0.999915        39449     11702.86
      81.151     0.999927        39450     13653.33
      81.151     0.999939        39450     16384.00
      81.151     0.999945        39450     18204.44
      82.431     0.999951        39451     20480.00
      82.431     0.999957        39451     23405.71
      82.431     0.999963        39451     27306.67
      82.431     0.999969        39451     32768.00
      82.431     0.999973        39451     36408.89
      82.879     0.999976        39452     40960.00
      82.879     1.000000        39452          inf
#[Mean    =        7.546, StdDeviation   =        7.154]
#[Max     =       82.816, Total count    =        39452]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  59376 requests in 30.00s, 3.79MB read
Requests/sec:   1979.33
Transfer/sec:    129.51KB